/* automatically generated by rust-bindgen 0.59.1 */

pub const TinyImageFormat_Count: u32 = 239;
pub const TinyImageFormat_TinyImageFormat_UNDEFINED: TinyImageFormat = 0;
pub const TinyImageFormat_TinyImageFormat_R1_UNORM: TinyImageFormat = 1;
pub const TinyImageFormat_TinyImageFormat_R2_UNORM: TinyImageFormat = 2;
pub const TinyImageFormat_TinyImageFormat_R4_UNORM: TinyImageFormat = 3;
pub const TinyImageFormat_TinyImageFormat_R4G4_UNORM: TinyImageFormat = 4;
pub const TinyImageFormat_TinyImageFormat_G4R4_UNORM: TinyImageFormat = 5;
pub const TinyImageFormat_TinyImageFormat_A8_UNORM: TinyImageFormat = 6;
pub const TinyImageFormat_TinyImageFormat_R8_UNORM: TinyImageFormat = 7;
pub const TinyImageFormat_TinyImageFormat_R8_SNORM: TinyImageFormat = 8;
pub const TinyImageFormat_TinyImageFormat_R8_UINT: TinyImageFormat = 9;
pub const TinyImageFormat_TinyImageFormat_R8_SINT: TinyImageFormat = 10;
pub const TinyImageFormat_TinyImageFormat_R8_SRGB: TinyImageFormat = 11;
pub const TinyImageFormat_TinyImageFormat_B2G3R3_UNORM: TinyImageFormat = 12;
pub const TinyImageFormat_TinyImageFormat_R4G4B4A4_UNORM: TinyImageFormat = 13;
pub const TinyImageFormat_TinyImageFormat_R4G4B4X4_UNORM: TinyImageFormat = 14;
pub const TinyImageFormat_TinyImageFormat_B4G4R4A4_UNORM: TinyImageFormat = 15;
pub const TinyImageFormat_TinyImageFormat_B4G4R4X4_UNORM: TinyImageFormat = 16;
pub const TinyImageFormat_TinyImageFormat_A4R4G4B4_UNORM: TinyImageFormat = 17;

pub const TinyImageFormat_TinyImageFormat_G16_B16_R16_3PLANE_422_UNORM: TinyImageFormat = 235;
pub const TinyImageFormat_TinyImageFormat_G16_B16_R16_3PLANE_444_UNORM: TinyImageFormat = 236;
pub const TinyImageFormat_TinyImageFormat_G16_B16R16_2PLANE_420_UNORM: TinyImageFormat = 237;
pub const TinyImageFormat_TinyImageFormat_G16_B16R16_2PLANE_422_UNORM: TinyImageFormat = 238;
pub type TinyImageFormat = ::std::os::raw::c_int;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_Red: TinyImageFormat_LogicalChannel = 0;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_Green: TinyImageFormat_LogicalChannel = 1;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_Blue: TinyImageFormat_LogicalChannel = 2;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_Alpha: TinyImageFormat_LogicalChannel = 3;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_Depth: TinyImageFormat_LogicalChannel = 0;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_Stencil: TinyImageFormat_LogicalChannel = 1;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_0: TinyImageFormat_LogicalChannel = -1;
pub const TinyImageFormat_LogicalChannel_TinyImageFormat_LC_1: TinyImageFormat_LogicalChannel = -2;
pub type TinyImageFormat_LogicalChannel = ::std::os::raw::c_int;
pub const TinyImageFormat_PhysicalChannel_TinyImageFormat_PC_0: TinyImageFormat_PhysicalChannel = 0;
pub const TinyImageFormat_PhysicalChannel_TinyImageFormat_PC_1: TinyImageFormat_PhysicalChannel = 1;
pub const TinyImageFormat_PhysicalChannel_TinyImageFormat_PC_2: TinyImageFormat_PhysicalChannel = 2;
pub const TinyImageFormat_PhysicalChannel_TinyImageFormat_PC_3: TinyImageFormat_PhysicalChannel = 3;
pub const TinyImageFormat_PhysicalChannel_TinyImageFormat_PC_CONST_0: TinyImageFormat_PhysicalChannel = -1;
pub const TinyImageFormat_PhysicalChannel_TinyImageFormat_PC_CONST_1: TinyImageFormat_PhysicalChannel = -2;
pub type TinyImageFormat_PhysicalChannel = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct TinyImageFormat_DecodeInput {
    pub __bindgen_anon_1: TinyImageFormat_DecodeInput__bindgen_ty_1,
    pub __bindgen_anon_2: TinyImageFormat_DecodeInput__bindgen_ty_2,
    pub pixelPlane2: *const ::std::os::raw::c_void,
    pub pixelPlane3: *const ::std::os::raw::c_void,
    pub pixelPlane4: *const ::std::os::raw::c_void,
    pub pixelPlane5: *const ::std::os::raw::c_void,
    pub pixelPlane6: *const ::std::os::raw::c_void,
    pub pixelPlane7: *const ::std::os::raw::c_void,
    pub pixelPlane8: *const ::std::os::raw::c_void,
    pub pixelPlane9: *const ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TinyImageFormat_DecodeInput__bindgen_ty_1 {
    pub pixel: *const ::std::os::raw::c_void,
    pub pixelPlane0: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TinyImageFormat_DecodeInput__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<TinyImageFormat_DecodeInput__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(TinyImageFormat_DecodeInput__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<TinyImageFormat_DecodeInput__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(TinyImageFormat_DecodeInput__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput__bindgen_ty_1>())).pixel as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput__bindgen_ty_1),
            "::",
            stringify!(pixel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<TinyImageFormat_DecodeInput__bindgen_ty_1>())).pixelPlane0 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput__bindgen_ty_1),
            "::",
            stringify!(pixelPlane0)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TinyImageFormat_DecodeInput__bindgen_ty_2 {
    pub lut: *const ::std::os::raw::c_void,
    pub pixelPlane1: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TinyImageFormat_DecodeInput__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<TinyImageFormat_DecodeInput__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(TinyImageFormat_DecodeInput__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<TinyImageFormat_DecodeInput__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(TinyImageFormat_DecodeInput__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput__bindgen_ty_2>())).lut as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput__bindgen_ty_2),
            "::",
            stringify!(lut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<TinyImageFormat_DecodeInput__bindgen_ty_2>())).pixelPlane1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput__bindgen_ty_2),
            "::",
            stringify!(pixelPlane1)
        )
    );
}
#[test]
fn bindgen_test_layout_TinyImageFormat_DecodeInput() {
    assert_eq!(
        ::std::mem::size_of::<TinyImageFormat_DecodeInput>(),
        80usize,
        concat!("Size of: ", stringify!(TinyImageFormat_DecodeInput))
    );
    assert_eq!(
        ::std::mem::align_of::<TinyImageFormat_DecodeInput>(),
        8usize,
        concat!("Alignment of ", stringify!(TinyImageFormat_DecodeInput))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane4 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane5 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane6 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane7 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane8 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_DecodeInput>())).pixelPlane9 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_DecodeInput),
            "::",
            stringify!(pixelPlane9)
        )
    );
}
pub type TinyImageFormat_FetchInput = TinyImageFormat_DecodeInput;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct TinyImageFormat_EncodeOutput {
    pub __bindgen_anon_1: TinyImageFormat_EncodeOutput__bindgen_ty_1,
    pub pixelPlane1: *const ::std::os::raw::c_void,
    pub pixelPlane2: *const ::std::os::raw::c_void,
    pub pixelPlane3: *const ::std::os::raw::c_void,
    pub pixelPlane4: *const ::std::os::raw::c_void,
    pub pixelPlane5: *const ::std::os::raw::c_void,
    pub pixelPlane6: *const ::std::os::raw::c_void,
    pub pixelPlane7: *const ::std::os::raw::c_void,
    pub pixelPlane8: *const ::std::os::raw::c_void,
    pub pixelPlane9: *const ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TinyImageFormat_EncodeOutput__bindgen_ty_1 {
    pub pixel: *const ::std::os::raw::c_void,
    pub pixelPlane0: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TinyImageFormat_EncodeOutput__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<TinyImageFormat_EncodeOutput__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(TinyImageFormat_EncodeOutput__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<TinyImageFormat_EncodeOutput__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(TinyImageFormat_EncodeOutput__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput__bindgen_ty_1>())).pixel as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput__bindgen_ty_1),
            "::",
            stringify!(pixel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput__bindgen_ty_1>())).pixelPlane0 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput__bindgen_ty_1),
            "::",
            stringify!(pixelPlane0)
        )
    );
}
#[test]
fn bindgen_test_layout_TinyImageFormat_EncodeOutput() {
    assert_eq!(
        ::std::mem::size_of::<TinyImageFormat_EncodeOutput>(),
        80usize,
        concat!("Size of: ", stringify!(TinyImageFormat_EncodeOutput))
    );
    assert_eq!(
        ::std::mem::align_of::<TinyImageFormat_EncodeOutput>(),
        8usize,
        concat!("Alignment of ", stringify!(TinyImageFormat_EncodeOutput))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane4 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane5 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane6 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane7 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane8 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TinyImageFormat_EncodeOutput>())).pixelPlane9 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(TinyImageFormat_EncodeOutput),
            "::",
            stringify!(pixelPlane9)
        )
    );
}
pub type TinyImageFormat_PutOutput = TinyImageFormat_EncodeOutput;
